Revit 2026 API

# PDFExportOptionsViewLinksInBlue Property

---

Whether set view links blue.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public bool ViewLinksInBlue { get; set; }
```
```vb
Public Property ViewLinksInBlue As Boolean
	Get
	Set
```
```cpp
public:
property bool ViewLinksInBlue {
	bool get ();
	void set (bool value);
}
```
```fsharp
member ViewLinksInBlue : bool with get, set
```

#### Property Value

Boolean

If true, links will be visible as blue. If false, they retain their default text color.

#### Reference

PDFExportOptions Class

Autodesk.Revit.DB Namespace